In [1]:
from google.cloud import bigquery
client = bigquery.Client()

sql = """
SELECT name, SUM(number) AS total
FROM `bigquery-public-data.usa_names.usa_1910_current`
GROUP BY name
ORDER BY total DESC
LIMIT 5
"""
df = client.query(sql, location="US").to_dataframe()
df

      name    total
0    James  5054074
1     John  4910976
2   Robert  4763102
3  Michael  4396482
4  William  3939912